app/Controllers/Clientes.php

SELECT *
FROM `clientes`
---
    public function index ()
    {
        $clientes = $this->cliente_model
                        ->findAll();

UPDATE `clientes` SET `nome` = 'Adamastor Pitako', `data_de_nascimento` = '1223-12-12', `telefone` = '1233345555', `endereco` = 'Av Bucetil', `limite_de_credito` = '2223', `id_cliente` = '1', `updated_at` = '2025-01-03 18:53:22'
WHERE `id_cliente` = '1'
INSERT INTO `clientes` (`nome`, `data_de_nascimento`, `telefone`, `endereco`, `limite_de_credito`, `created_at`, `updated_at`) VALUES ('Adamastor Pitako', '1999-02-02', '1233345555', 'Av Cuzil', '444', '2025-01-17 15:42:16', '2025-01-17 15:42:16')
---
    public function store (){

        $dados = $this->request->getVar();

        if(isset($dados['id_cliente'])):

            $this->cliente_model
                ->where('id_cliente', $dados['id_cliente'])
                ->set($dados)
                ->update();

                return redirect()->to("/clientes/editar/{$dados['id_cliente']}");

        endif;

        $this->cliente_model->insert($dados);

DELETE FROM `clientes`
WHERE `id_cliente` = '4'
---
    public function excluir ($id_cliente) {

        $id_cliente  = $this->request->getVar('id_cliente');

        $this -> cliente_model
        ->where('id_cliente', $id_cliente)
        ->delete();

SELECT *
FROM `clientes`
WHERE `id_cliente` = '1'
 LIMIT 1
---
    public function editar ($id_cliente){

            $cliente = $this->cliente_model
                                            ->where('id_cliente', $id_cliente)
                                            ->first();

SELECT *
FROM `clientes`
WHERE `id_cliente` = '6'
 LIMIT 1
---
    public function ver ($id_cliente){

        $cliente = $this->cliente_model
                                        ->where('id_cliente', $id_cliente)
                                        ->first();